name: "med_c5_euclid_d4096"
layers {
  name: "shot_windows"
  type: VIDEO_SHOT_WINDOW_DATA
  top: "data"
  #top: "video_id"
  video_shot_window_data_param {
    source: "/data2/vigneshr/ICCV2015/data/med_dev_event_kit_shot_c3_lmdb_revised"
    backend: LMDB
    batch_size: 128
# Negative buffer parameter
    num_negative_samples: 10
    max_buffer_size: 2000
    negative_swap_percentage: 30
  }

  include: { phase: TRAIN }
}


layers {
  name: "shot_windows"
  type: VIDEO_SHOT_WINDOW_DATA
  top: "data"
  #top: "video_id"
  video_shot_window_data_param {
    #source: "/data2/vigneshr/ICCV2015/data/med_dev_event_kit_shot_c3_lmdb_revised_validation"
    source: "/data2/vigneshr/ICCV2015/data/med_event_kit_test_shot_c3_validation_lmdb"
    backend: LMDB
    batch_size: 389
    #batch_size: 350
# Negative buffer parameter
    num_negative_samples: 10
    max_buffer_size: 100
    negative_swap_percentage: 0
  }

  include: { phase: TEST}
}


layers {
  name: "slice_input_data"
  type: SLICE
  bottom: "data"
  top: "target_datum"
  top: "context_datum_1"
  top: "context_datum_2"
  top: "negative_datum_1"
  top: "negative_datum_2"
  top: "negative_datum_3"
  top: "negative_datum_4"
  top: "negative_datum_5"
  top: "negative_datum_6"
  top: "negative_datum_7"
  top: "negative_datum_8"
  top: "negative_datum_9"
  top: "negative_datum_10"

  slice_param {
    slice_dim: 1  
  }
}

layers {
  name: "batch_concat_input"
  type: CONCAT
  bottom: "target_datum"
  bottom: "context_datum_1"
  bottom: "context_datum_2"
  bottom: "negative_datum_1"
  bottom: "negative_datum_2"
  bottom: "negative_datum_3"
  bottom: "negative_datum_4"
  bottom: "negative_datum_5"
  bottom: "negative_datum_6"
  bottom: "negative_datum_7"
  bottom: "negative_datum_8"
  bottom: "negative_datum_9"
  bottom: "negative_datum_10"
  top: "concat_input_datums"
  concat_param {
    concat_dim: 0  
  }
}


layers {
  name: "word_embedding"
  type: INNER_PRODUCT
  bottom: "concat_input_datums"
  top: "ip2"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "drop2"
  type: DROPOUT
  bottom: "ip2"
  top: "ip2"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layers {
  name: "slice_emb"
  type: SLICE
  bottom: "ip2"
  top: "target_emb"
  top: "context_emb_1"
  top: "context_emb_2"
  top: "negative_emb_1"
  top: "negative_emb_2"
  top: "negative_emb_3"
  top: "negative_emb_4"
  top: "negative_emb_5"
  top: "negative_emb_6"
  top: "negative_emb_7"
  top: "negative_emb_8"
  top: "negative_emb_9"
  top: "negative_emb_10"

  slice_param {
    slice_dim: 0
  }
}


layers {
  name: "avg_context_emb"
  type: ELTWISE
  bottom: "context_emb_1"
  bottom: "context_emb_2"
  #bottom: "video_id_emb"
  top: "context_feature"
  eltwise_param {
    operation: SUM
    coeff: 0.5
    coeff: 0.5
    #coeff: 0.333
  }
}

layers {
  name: "feature_weight_pred"
  type: INNER_PRODUCT
  bottom: "context_feature"
  top: "feature_weight"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "prod_true"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "target_emb"
  top: "target_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_true"
  type: SUM
  bottom: "target_prod"
  top: "target_score"
  
  sum_param {
    num_output: 12  
  }
}

# Negative 1

layers {
  name: "prod_neg_1"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_1"
  top: "negative_emb_1_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_1"
  type: SUM
  bottom: "negative_emb_1_prod"
  top: "neg_score_1"
}

# Negative 2

layers {
  name: "prod_neg_2"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_2"
  top: "negative_emb_2_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_2"
  type: SUM
  bottom: "negative_emb_2_prod"
  top: "neg_score_2"
}

# Negative 3

layers {
  name: "prod_neg_3"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_3"
  top: "negative_emb_3_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_3"
  type: SUM
  bottom: "negative_emb_3_prod"
  top: "neg_score_3"
}

# Negative 4

layers {
  name: "prod_neg_4"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_4"
  top: "negative_emb_4_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_4"
  type: SUM
  bottom: "negative_emb_4_prod"
  top: "neg_score_4"
}

# Negative 5

layers {
  name: "prod_neg_5"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_5"
  top: "negative_emb_5_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_5"
  type: SUM
  bottom: "negative_emb_5_prod"
  top: "neg_score_5"
}

# Negative 6

layers {
  name: "prod_neg_6"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_6"
  top: "negative_emb_6_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_6"
  type: SUM
  bottom: "negative_emb_6_prod"
  top: "neg_score_6"
}

# Negative 7

layers {
  name: "prod_neg_7"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_7"
  top: "negative_emb_7_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_7"
  type: SUM
  bottom: "negative_emb_7_prod"
  top: "neg_score_7"
}

# Negative 8

layers {
  name: "prod_neg_8"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_8"
  top: "negative_emb_8_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_8"
  type: SUM
  bottom: "negative_emb_8_prod"
  top: "neg_score_8"
}

# Negative 9

layers {
  name: "prod_neg_9"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_9"
  top: "negative_emb_9_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_9"
  type: SUM
  bottom: "negative_emb_9_prod"
  top: "neg_score_9"
}

# Negative 10

layers {
  name: "prod_neg_10"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "negative_emb_10"
  top: "negative_emb_10_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_10"
  type: SUM
  bottom: "negative_emb_10_prod"
  top: "neg_score_10"
}

# Negative context-1

layers {
  name: "prod_neg_context_1"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "context_emb_1"
  top: "negative_emb_context_1_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_context_1"
  type: SUM
  bottom: "negative_emb_context_1_prod"
  top: "neg_score_context_1"
}

# Negative context-2

layers {
  name: "prod_neg_context_2"
  type: ELTWISE
  bottom: "feature_weight"  
  bottom: "context_emb_2"
  top: "negative_emb_context_2_prod"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_context_2"
  type: SUM
  bottom: "negative_emb_context_2_prod"
  top: "neg_score_context_2"
}

layers {
  name: "concat_negative_scores"
  type: CONCAT
  bottom: "neg_score_1"
  bottom: "neg_score_2"
  bottom: "neg_score_3"
  bottom: "neg_score_4"
  bottom: "neg_score_5"
  bottom: "neg_score_6"
  bottom: "neg_score_7"
  bottom: "neg_score_8"
  bottom: "neg_score_9"
  bottom: "neg_score_10"
  bottom: "neg_score_context_1"
  bottom: "neg_score_context_2"

  top: "negative_scores"
  concat_param {
    concat_dim: 1  
  }
}

# Max-margin loss function

layers {
  name: "max_margin_loss"
  type: MAX_MARGIN_LOSS
  bottom: "target_score"
  bottom: "negative_scores"
  top: "loss_output"
  top: "train_violations"
  loss_weight: 1.0
  loss_weight: 0.0
  max_margin_loss_param {
    norm: L2  
  }

  include: { phase: TRAIN}
}

layers {
  name: "max_margin_loss"
  type: MAX_MARGIN_LOSS
  bottom: "target_score"
  bottom: "negative_scores"
  top: "loss_output"
  top: "test_violations"
  loss_weight: 1.0
  loss_weight: 0.0

  max_margin_loss_param {
    norm: L2  
  }
  include: { phase: TEST}
}
