name: "med_c5_euclid_d64"
layers {
  name: "shot_windows"
  type: VIDEO_SHOT_WINDOW_DATA
  top: "data"
  video_shot_window_data_param {
    source: "/data2/vigneshr/ICCV2015/data/med_dev_event_kit_shot_c5_lmdb"
    backend: LMDB
    batch_size: 64
  }

  include: { phase: TRAIN }
}

layers {
  name: "slice_input_data"
  type: SLICE
  bottom: "data"
  top: "target_datum"
  top: "context_datum_1"
  top: "context_datum_2"
  top: "context_datum_3"
  top: "context_datum_4"
  slice_param {
    slice_dim: 1  
  }
}

layers {
  name: "batch_concat_input"
  type: CONCAT
  bottom: "target_datum"
  bottom: "context_datum_1"
  bottom: "context_datum_2"
  bottom: "context_datum_3"
  bottom: "context_datum_4"
  top: "concat_input_datums"
  concat_param {
    concat_dim: 0  
  }
}

layers {
  name: "word_embedding"
  type: INNER_PRODUCT
  bottom: "concat_input_datums"
  top: "ip2"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "word_embedding_norm"
  type: NORMALIZATION
  bottom: "ip2"
  top: "ip2_norm"
}

layers {
  name: "slice_emb"
  type: SLICE
  bottom: "ip2_norm"
  top: "target_emb"
  top: "context_emb_1"
  top: "context_emb_2"
  top: "context_emb_3"
  top: "context_emb_4"
  slice_param {
    slice_dim: 0
  }
}

layers {
  name: "concat_context_emb"
  type: CONCAT
  bottom: "context_emb_1"
  bottom: "context_emb_2"
  bottom: "context_emb_3"
  bottom: "context_emb_4"
  top: "context_feature"
  concat_param {
    concat_dim: 1  
  }
}

layers {
  name: "target_pred"
  type: INNER_PRODUCT
  bottom: "context_feature"
  top: "target_bogus"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "target_bogus_norm"
  type: NORMALIZATION
  bottom: "target_bogus"
  top: "target_bogus_norm"
}

layers {
  name: "euclid_loss"
  type: EUCLIDEAN_LOSS
  bottom: "target_bogus_norm"
  bottom: "target_emb"
  top: "loss_output"
}
