name: "med_c5_w1000_d128_b10"
layers {
  name: "shot_windows"
  type: VIDEO_SHOT_WINDOW_DATA
  top: "data"
  top: "video_id"
  video_shot_window_data_param {
    source: "/data2/vigneshr/ICCV2015/data/med_dev_event_kit_shot_c5_lmdb"
    backend: LMDB
    batch_size: 64
  }

  include: { phase: TRAIN }
}

layers {
  name: "slice_input_data"
  type: SLICE
  bottom: "data"
  top: "target_datum"
  top: "context_datum_1"
  top: "context_datum_2"
  top: "context_datum_3"
  top: "context_datum_4"
  slice_param {
    slice_dim: 1  
  }
}

layers {
  name: "batch_concat_input"
  type: CONCAT
  bottom: "target_datum"
  bottom: "context_datum_1"
  bottom: "context_datum_2"
  bottom: "context_datum_3"
  bottom: "context_datum_4"
  top: "concat_input_datums"
  concat_param {
    concat_dim: 0  
  }
}

layers {
  name: "cluster_ip"
  type: INNER_PRODUCT
  bottom: "concat_input_datums"
  top: "ip1"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "softmax_cluster"
  type: SOFTMAX
  bottom: "ip1"
  top: "word_cluster"
}

layers {
  name: "slice_clusters"
  type: SLICE
  bottom: "word_cluster"
  top: "target_shot_cluster"
  top: "context_cluster_1"
  top: "context_cluster_2"
  top: "context_cluster_3"
  top: "context_cluster_4"
  slice_param {
    slice_dim: 0
  }
}

layers {
  name: "concat_context_clusters"
  type: CONCAT
  bottom: "context_cluster_1"
  bottom: "context_cluster_2"
  bottom: "context_cluster_3"
  bottom: "context_cluster_4"
  top: "concat_context_cluster"
  concat_param {
    concat_dim: 0  
  }
}

layers {
  name: "word_embedding"
  type: INNER_PRODUCT
  bottom: "concat_context_cluster"
  top: "ip2"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "slice_emb"
  type: SLICE
  bottom: "ip2"
  top: "context_emb_1"
  top: "context_emb_2"
  top: "context_emb_3"
  top: "context_emb_4"
  slice_param {
    slice_dim: 0
  }
}

layers {
  name: "concat_context_emb"
  type: CONCAT
  bottom: "context_emb_1"
  bottom: "context_emb_2"
  bottom: "context_emb_3"
  bottom: "context_emb_4"
  top: "context_feature"
  concat_param {
    concat_dim: 1  
  }
}

layers {
  name: "target_score_pred"
  type: INNER_PRODUCT
  bottom: "context_feature"
  top: "target_score"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "cross_ent_loss"
  type: SIGMOID_CROSS_ENTROPY_LOSS
  bottom: "target_score"
  bottom: "target_shot_cluster"
  top: "loss_output"
}
