name: "med_c5_euclid_d64"
layers {
  name: "shot_windows"
  type: VIDEO_SHOT_WINDOW_DATA
  top: "data"
  top: "video_id"
  video_shot_window_data_param {
    source: "/data2/vigneshr/ICCV2015/data/med_event_kit_test_shot_c3_lmdb"
    #train= "/data2/vigneshr/ICCV2015/data/med_dev_event_kit_shot_c3_lmdb_revised"
    backend: LMDB
    batch_size: 64
  }
}

layers {
  name: "video_id_embedding_test"
  type: ID_TO_WEIGHT_MAPPING
  bottom: "video_id"
  top: "video_id_emb_test"
  blobs_lr: 1
  id_to_weight_mapping_param {
    num_output: 64
    max_ids: 700
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.1
    }
  }   
}

layers {
  name: "slice_input_data"
  type: SLICE
  bottom: "data"
  top: "target_datum"
  top: "context_datum_1"
  top: "context_datum_2"
  #top: "context_datum_3"
  #top: "context_datum_4"
  slice_param {
    slice_dim: 1  
  }
}

layers {
  name: "batch_concat_input"
  type: CONCAT
  bottom: "target_datum"
  bottom: "context_datum_1"
  bottom: "context_datum_2"
  #bottom: "context_datum_3"
  #bottom: "context_datum_4"
  top: "concat_input_datums"
  concat_param {
    concat_dim: 0  
  }
}

layers {
  name: "word_embedding"
  type: INNER_PRODUCT
  bottom: "concat_input_datums"
  top: "ip2"
  blobs_lr: 0
  blobs_lr: 0
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "slice_emb"
  type: SLICE
  bottom: "ip2"
  top: "target_emb"
  top: "context_emb_1"
  top: "context_emb_2"
  #top: "context_emb_3"
  #top: "context_emb_4"
  slice_param {
    slice_dim: 0
  }
}

layers {
  name: "concat_context_emb"
  type: CONCAT
  bottom: "context_emb_1"
  bottom: "context_emb_2"
  bottom: "video_id_emb_test"
  top: "context_feature"
  concat_param {
    concat_dim: 1  
  }
}

#layers {
#  name: "avg_context_emb"
#  type: ELTWISE
#  bottom: "context_emb_1"
#  bottom: "context_emb_2"
#  #bottom: "context_emb_3"
#  #bottom: "context_emb_4"
#  bottom: "video_id_emb"
#  top: "context_feature"
#  eltwise_param {
#    operation: SUM
#    coeff: 0.333
#    coeff: 0.333
#    coeff: 0.333
#    #coeff: 0.20
#    #coeff: 0.20
#  }
#}

layers {
  name: "target_score_pred"
  type: INNER_PRODUCT
  bottom: "context_feature"
  top: "target_score"
  blobs_lr: 0
  blobs_lr: 0
  inner_product_param {
    num_output: 64
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "euclid_loss"
  type: EUCLIDEAN_LOSS
  bottom: "target_score"
  bottom: "target_emb"
  top: "loss_output"
}
