name: "med_c5_euclid_d4096"
layers {
  name: "shot_windows"
  type: VIDEO_SHOT_WINDOW_DATA
  top: "data"
  top: "video_id_train"
  video_shot_window_data_param {
    source: "/data2/vigneshr/ICCV2015/data/med_event_kit_only_train_shot_pairs_lmdb_revised_fc6"
    backend: LMDB
    batch_size: 128
# Negative buffer parameter
    num_negative_samples: 10
    max_buffer_size: 1500
    negative_swap_percentage: 30
  }
}

layers {
  name: "slice_input_data"
  type: SLICE
  bottom: "data"
  top: "target_datum"
  top: "context_datum_1"
  top: "negative_datum_1"
  top: "negative_datum_2"
  top: "negative_datum_3"
  top: "negative_datum_4"
  top: "negative_datum_5"
  top: "negative_datum_6"
  top: "negative_datum_7"
  top: "negative_datum_8"
  top: "negative_datum_9"
  top: "negative_datum_10"

  slice_param {
    slice_dim: 1  
  }}

layers {
  name: "batch_concat_input"
  type: CONCAT
  bottom: "target_datum"
  bottom: "context_datum_1"
  bottom: "negative_datum_1"
  bottom: "negative_datum_2"
  bottom: "negative_datum_3"
  bottom: "negative_datum_4"
  bottom: "negative_datum_5"
  bottom: "negative_datum_6"
  bottom: "negative_datum_7"
  bottom: "negative_datum_8"
  bottom: "negative_datum_9"
  bottom: "negative_datum_10"
  top: "concat_input_datums"
  concat_param {
    concat_dim: 0  
  }}

layers {
  name: "flatten_input"
  type: FLATTEN
  bottom: "concat_input_datums"
  top: "concat_input_datums_flat"  
}

layers {
  name: "slice_extra_bit"
  type: SLICE
  bottom: "concat_input_datums_flat"
  top: "original_feature"
  top: "dummy_feature"
  slice_param {
   slice_dim: 1
   slice_point: 4096
  }
}

layers {
  name: "silence_dummy"
  type: SILENCE
  bottom: "dummy_feature"  
}

layers {
  name: "fc7"
  type: INNER_PRODUCT
  bottom: "original_feature"
  top: "ip1"
  blobs_lr: 0
  blobs_lr: 0
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }

}

layers {
  name: "fc7_relu"
  type: RELU
  top: "ip2_nonorm"
  bottom: "ip1"  
}

layers {
  name: "word_embedding_norm"
  type: NORMALIZATION
  bottom: "ip2_nonorm"
  top: "ip2"
}

layers {
  name: "slice_emb"
  type: SLICE
  bottom: "ip2"
  top: "target_emb"
  top: "context_emb_1"
  top: "negative_emb_1"
  top: "negative_emb_2"
  top: "negative_emb_3"
  top: "negative_emb_4"
  top: "negative_emb_5"
  top: "negative_emb_6"
  top: "negative_emb_7"
  top: "negative_emb_8"
  top: "negative_emb_9"
  top: "negative_emb_10"

  slice_param {
    slice_dim: 0
  }}

layers {
  name: "silence_context"
  type: SILENCE
  bottom: "context_emb_1"  
}

# ------------------------------- Exemplar svm like setup

layers {
  name: "video_id_embedding_test"
  type: ID_TO_WEIGHT_MAPPING
  bottom: "video_id_train"
  top: "exemplar_vector"
  blobs_lr: 1
  weight_decay: 1
  id_to_weight_mapping_param {
    num_output: 4096
    max_ids: 6000
    weight_filler {
      type: "xavier"
      #type: "gaussian"
      #std: 1
    }
  }

}

layers {
  name: "prod_true_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "target_emb"
  top: "target_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }}

layers {
  name: "sum_true_svm"
  type: SUM
  bottom: "target_prod_svm"
  top: "target_score_svm"
  
  sum_param {
    num_output: 10
  }}

# Negative 1

layers {
  name: "prod_neg_1_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_1"
  top: "negative_emb_1_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }}

layers {
  name: "sum_neg_1_svm"
  type: SUM
  bottom: "negative_emb_1_prod_svm"
  top: "neg_score_1_svm"}

# Negative 2

layers {
  name: "prod_neg_2_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_2"
  top: "negative_emb_2_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }}

layers {
  name: "sum_neg_2_svm"
  type: SUM
  bottom: "negative_emb_2_prod_svm"
  top: "neg_score_2_svm"}

# Negative 3

layers {
  name: "prod_neg_3_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_3"
  top: "negative_emb_3_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }}

layers {
  name: "sum_neg_3_svm"
  type: SUM
  bottom: "negative_emb_3_prod_svm"
  top: "neg_score_3_svm"}

# Negative 4

layers {
  name: "prod_neg_4_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_4"
  top: "negative_emb_4_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }}

layers {
  name: "sum_neg_4_svm"
  type: SUM
  bottom: "negative_emb_4_prod_svm"
  top: "neg_score_4_svm"}

# Negative 5

layers {
  name: "prod_neg_5_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_5"
  top: "negative_emb_5_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }}

layers {
  name: "sum_neg_5_svm"
  type: SUM
  bottom: "negative_emb_5_prod_svm"
  top: "neg_score_5_svm"}

# Negative 6

layers {
  name: "prod_neg_6_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_6"
  top: "negative_emb_6_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }}

layers {
  name: "sum_neg_6_svm"
  type: SUM
  bottom: "negative_emb_6_prod_svm"
  top: "neg_score_6_svm"
}

# Negative 7

layers {
  name: "prod_neg_7_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_7"
  top: "negative_emb_7_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_7_svm"
  type: SUM
  bottom: "negative_emb_7_prod_svm"
  top: "neg_score_7_svm"
}

# Negative 8

layers {
  name: "prod_neg_8_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_8"
  top: "negative_emb_8_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_8_svm"
  type: SUM
  bottom: "negative_emb_8_prod_svm"
  top: "neg_score_8_svm"
}

# Negative 9

layers {
  name: "prod_neg_9_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_9"
  top: "negative_emb_9_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }}

layers {
  name: "sum_neg_9_svm"
  type: SUM
  bottom: "negative_emb_9_prod_svm"
  top: "neg_score_9_svm"
}

# Negative 10

layers {
  name: "prod_neg_10_svm"
  type: ELTWISE
  bottom: "exemplar_vector"  
  bottom: "negative_emb_10"
  top: "negative_emb_10_prod_svm"
  
  eltwise_param {
    operation: PROD  
  }
}

layers {
  name: "sum_neg_10_svm"
  type: SUM
  bottom: "negative_emb_10_prod_svm"
  top: "neg_score_10_svm"
}

layers {
  name: "concat_negative_scores_svm"
  type: CONCAT
  bottom: "neg_score_1_svm"
  bottom: "neg_score_2_svm"
  bottom: "neg_score_3_svm"
  bottom: "neg_score_4_svm"
  bottom: "neg_score_5_svm"
  bottom: "neg_score_6_svm"
  bottom: "neg_score_7_svm"
  bottom: "neg_score_8_svm"
  bottom: "neg_score_9_svm"
  bottom: "neg_score_10_svm"

  top: "negative_scores_svm"
  concat_param {
    concat_dim: 1  
  }

}

# Max-margin loss function

layers {
  name: "max_margin_loss_svm"
  type: MAX_MARGIN_LOSS
  bottom: "target_score_svm"
  bottom: "negative_scores_svm"
  top: "loss_output_svm"
  top: "train_violations_svm"
  loss_weight: 2.0
  loss_weight: 0.0
  max_margin_loss_param {
    norm: L2  
  }

}
